{
  "meta": {
    "last_update": "2025-11-07T03:15:40Z",
    "keywords": [
      "RAG",
      "Retrieval-Augmented Generation",
      "Computer Vision"
    ],
    "counts": {
      "RAG": 15,
      "Retrieval-Augmented Generation": 15,
      "Computer Vision": 15
    }
  },
  "data": {
    "RAG": [
      {
        "title": "ASVRI-Legal: Fine-Tuning LLMs with Retrieval Augmented Generation for Enhanced Legal Regulation",
        "authors": [
          "One Octadion",
          "Bondan Sapta Prakoso",
          "Nanang Yudi Setiawan",
          "Novanto Yudistira"
        ],
        "published": "2025-11-05",
        "link": "http://arxiv.org/abs/2511.03563v1",
        "summary": "In this study, we explore the fine-tuning of Large Language Models (LLMs) to better support policymakers in their crucial work of understanding, analyzing, and crafting legal regulations. To equip the model with a deep understanding of legal texts, we curated a supervised dataset tailored to the specific needs of the legal domain. Additionally, we integrated the Retrieval-Augmented Generation (RAG..."
      },
      {
        "title": "RAGBoost: Efficient Retrieval-Augmented Generation with Accuracy-Preserving Context Reuse",
        "authors": [
          "Yinsicheng Jiang",
          "Yeqi Huang",
          "Liang Cheng",
          "Cheng Deng",
          "Xuan Sun",
          "Luo Mai"
        ],
        "published": "2025-11-05",
        "link": "http://arxiv.org/abs/2511.03475v1",
        "summary": "Retrieval-augmented generation (RAG) enhances large language models (LLMs) with retrieved context but often suffers from downgraded prefill performance as modern applications demand longer and more complex inputs. Existing caching techniques either preserve accuracy with low cache reuse or improve reuse at the cost of degraded reasoning quality. We present RAGBoost, an efficient RAG system that ac..."
      },
      {
        "title": "Comparing the Performance of LLMs in RAG-based Question-Answering: A Case Study in Computer Science Literature",
        "authors": [
          "Ranul Dayarathne",
          "Uvini Ranaweera",
          "Upeksha Ganegoda"
        ],
        "published": "2025-11-05",
        "link": "http://arxiv.org/abs/2511.03261v1",
        "summary": "Retrieval Augmented Generation (RAG) is emerging as a powerful technique to enhance the capabilities of Generative AI models by reducing hallucination. Thus, the increasing prominence of RAG alongside Large Language Models (LLMs) has sparked interest in comparing the performance of different LLMs in question-answering (QA) in diverse domains. This study compares the performance of four open-source..."
      },
      {
        "title": "LGM: Enhancing Large Language Models with Conceptual Meta-Relations and Iterative Retrieval",
        "authors": [
          "Wenchang Lei",
          "Ping Zou",
          "Yue Wang",
          "Feng Sun",
          "Lei Zhao"
        ],
        "published": "2025-11-05",
        "link": "http://arxiv.org/abs/2511.03214v1",
        "summary": "Large language models (LLMs) exhibit strong semantic understanding, yet struggle when user instructions involve ambiguous or conceptually misaligned terms. We propose the Language Graph Model (LGM) to enhance conceptual clarity by extracting meta-relations-inheritance, alias, and composition-from natural language. The model further employs a reflection mechanism to validate these meta-relations. L..."
      },
      {
        "title": "Forecast2Anomaly (F2A): Adapting Multivariate Time Series Foundation Models for Anomaly Prediction",
        "authors": [
          "Atif Hassan",
          "Tarun Kumar",
          "Ashish Mishra",
          "Sergey Serebryakov",
          "Satish Kumar Mopur",
          "Phanidhar Koganti",
          "Murthy Chelankuri",
          "Ramanagopal Vogety",
          "Suparna Bhattacharya",
          "Martin Foltin"
        ],
        "published": "2025-11-05",
        "link": "http://arxiv.org/abs/2511.03149v1",
        "summary": "Forecasting anomalies (anomaly prediction) in multivariate time series from different real-world, dynamic, and complex systems is vital for preempting critical failures, leading to a substantial minimization in operational costs and human labor. Yet, existing methods are limited to specific systems while failing to generalize to evolving anomaly patterns over time. In contrast, pretrained Time Ser..."
      },
      {
        "title": "A Proprietary Model-Based Safety Response Framework for AI Agents",
        "authors": [
          "Qi Li",
          "Jianjun Xu",
          "Pingtao Wei",
          "Jiu Li",
          "Peiqiang Zhao",
          "Jiwei Shi",
          "Xuan Zhang",
          "Yanhui Yang",
          "Xiaodong Hui",
          "Peng Xu",
          "Wenqin Shao"
        ],
        "published": "2025-11-05",
        "link": "http://arxiv.org/abs/2511.03138v1",
        "summary": "With the widespread application of Large Language Models (LLMs), their associated security issues have become increasingly prominent, severely constraining their trustworthy deployment in critical domains. This paper proposes a novel safety response framework designed to systematically safeguard LLMs at both the input and output levels. At the input level, the framework employs a supervised fine-t..."
      },
      {
        "title": "Systematizing LLM Persona Design: A Four-Quadrant Technical Taxonomy for AI Companion Applications",
        "authors": [
          "Esther Sun",
          "Zichu Wu"
        ],
        "published": "2025-11-04",
        "link": "http://arxiv.org/abs/2511.02979v1",
        "summary": "The design and application of LLM-based personas in AI companionship is a rapidly expanding but fragmented field, spanning from virtual emotional companions and game NPCs to embodied functional robots. This diversity in objectives, modality, and technical stacks creates an urgent need for a unified framework. To address this gap, this paper systematizes the field by proposing a Four-Quadrant Techn..."
      },
      {
        "title": "Cache Mechanism for Agent RAG Systems",
        "authors": [
          "Shuhang Lin",
          "Zhencan Peng",
          "Lingyao Li",
          "Xiao Lin",
          "Xi Zhu",
          "Yongfeng Zhang"
        ],
        "published": "2025-11-04",
        "link": "http://arxiv.org/abs/2511.02919v1",
        "summary": "Recent advances in Large Language Model (LLM)-based agents have been propelled by Retrieval-Augmented Generation (RAG), which grants the models access to vast external knowledge bases. Despite RAG's success in improving agent performance, agent-level cache management, particularly constructing, maintaining, and updating a compact, relevant corpus dynamically tailored to each agent's need, remains ..."
      },
      {
        "title": "Using Span Queries to Optimize for Cache and Attention Locality",
        "authors": [
          "Paul Castro",
          "Nick Mitchell",
          "Nathan Ordonez",
          "Thomas Parnell",
          "Mudhakar Srivatsa",
          "Antoni Viros i Martin"
        ],
        "published": "2025-11-04",
        "link": "http://arxiv.org/abs/2511.02749v1",
        "summary": "Clients are evolving beyond chat completion, and now include a variety of innovative inference-time scaling and deep reasoning techniques. At the same time, inference servers remain heavily optimized for chat completion. Prior work has shown that large improvements to KV cache hit rate are possible if inference servers evolve towards these non-chat use cases. However, they offer solutions that are..."
      },
      {
        "title": "Relational Deep Dive: Error-Aware Queries Over Unstructured Data",
        "authors": [
          "Daren Chao",
          "Kaiwen Chen",
          "Naiqing Guan",
          "Nick Koudas"
        ],
        "published": "2025-11-04",
        "link": "http://arxiv.org/abs/2511.02711v1",
        "summary": "Unstructured data is pervasive, but analytical queries demand structured representations, creating a significant extraction challenge. Existing methods like RAG lack schema awareness and struggle with cross-document alignment, leading to high error rates. We propose ReDD (Relational Deep Dive), a framework that dynamically discovers query-specific schemas, populates relational tables, and ensures ..."
      },
      {
        "title": "ChartM$^3$: A Multi-Stage Code-Driven Pipeline for Constructing Multi-Dimensional and Multi-Step Visual Reasoning Data in Chart Comprehension",
        "authors": [
          "Duo Xu",
          "Hao Cheng",
          "Xin Lin",
          "Zhen Xie",
          "Hao Wang"
        ],
        "published": "2025-11-04",
        "link": "http://arxiv.org/abs/2511.02415v1",
        "summary": "Complex chart understanding tasks demand advanced visual recognition and reasoning capabilities from multimodal large language models (MLLMs). However, current research provides limited coverage of complex chart scenarios and computation-intensive reasoning tasks prevalent in real-world applications. This study proposes an automated multi-stage code-driven pipeline for systematically generating vi..."
      },
      {
        "title": "LUMA-RAG: Lifelong Multimodal Agents with Provably Stable Streaming Alignment",
        "authors": [
          "Rohan Wandre",
          "Yash Gajewar",
          "Namrata Patel",
          "Vivek Dhalkari"
        ],
        "published": "2025-11-04",
        "link": "http://arxiv.org/abs/2511.02371v1",
        "summary": "Retrieval-Augmented Generation (RAG) has emerged as the dominant paradigm for grounding large language model outputs in verifiable evidence. However, as modern AI agents transition from static knowledge bases to continuous multimodal streams encompassing text, images, video, and audio, two critical challenges arise: maintaining index freshness without prohibitive re-indexing costs, and preserving ..."
      },
      {
        "title": "InsurAgent: A Large Language Model-Empowered Agent for Simulating Individual Behavior in Purchasing Flood Insurance",
        "authors": [
          "Ziheng Geng",
          "Jiachen Liu",
          "Ran Cao",
          "Lu Cheng",
          "Dan M. Frangopol",
          "Minghui Cheng"
        ],
        "published": "2025-11-03",
        "link": "http://arxiv.org/abs/2511.02119v1",
        "summary": "Flood insurance is an effective strategy for individuals to mitigate disaster-related losses. However, participation rates among at-risk populations in the United States remain strikingly low. This gap underscores the need to understand and model the behavioral mechanisms underlying insurance decisions. Large language models (LLMs) have recently exhibited human-like intelligence across wide-rangin..."
      },
      {
        "title": "PROPEX-RAG: Enhanced GraphRAG using Prompt-Driven Prompt Execution",
        "authors": [
          "Tejas Sarnaik",
          "Manan Shah",
          "Ravi Hegde"
        ],
        "published": "2025-11-03",
        "link": "http://arxiv.org/abs/2511.01802v1",
        "summary": "Retrieval-Augmented Generation (RAG) has become a robust framework for enhancing Large Language Models (LLMs) with external knowledge. Recent advances in RAG have investigated graph based retrieval for intricate reasoning; however, the influence of prompt design on enhancing the retrieval and reasoning process is still considerably under-examined. In this paper, we present a prompt-driven GraphRAG..."
      },
      {
        "title": "Hybrid Retrieval-Augmented Generation Agent for Trustworthy Legal Question Answering in Judicial Forensics",
        "authors": [
          "Yueqing Xi",
          "Yifan Bai",
          "Huasen Luo",
          "Weiliang Wen",
          "Hui Liu",
          "Haoliang Li"
        ],
        "published": "2025-11-03",
        "link": "http://arxiv.org/abs/2511.01668v1",
        "summary": "As artificial intelligence permeates judicial forensics, ensuring the veracity and traceability of legal question answering (QA) has become critical. Conventional large language models (LLMs) are prone to hallucination, risking misleading guidance in legal consultation, while static knowledge bases struggle to keep pace with frequently updated statutes and case law. We present a hybrid legal QA ag..."
      }
    ],
    "Retrieval-Augmented Generation": [
      {
        "title": "High-order Accumulative Regularization for Gradient Minimization in Convex Programming",
        "authors": [
          "Yao Ji",
          "Guanghui Lan"
        ],
        "published": "2025-11-05",
        "link": "http://arxiv.org/abs/2511.03723v1",
        "summary": "This paper develops a unified framework of high-order accumulative regularization (AR) framework for convex and uniformly convex gradient norm minimization. Existing high-order methods often exhibit a gap: the function value residual decreases fast, while the gradient norm converges much slower. To close this gap, we introduce AR that systematically transforms fast function value residual converge..."
      },
      {
        "title": "Distance Exceptional Graphs and the Curvature Index",
        "authors": [
          "Sawyer Jack Robertson",
          "Finn Southerland",
          "Erlang Surya"
        ],
        "published": "2025-11-05",
        "link": "http://arxiv.org/abs/2511.03719v1",
        "summary": "A graph $G=(V,E)$ on $n$ vertices is said to be \\emph{distance exceptional} if the equation $D\\vec{x} = \\vec{1}$ admits no solution $\\vec{x}\\in\\mathbb{R}^{n}$, where $D\\in\\mathbb{R}^{n\\times n}$ is the shortest path distance matrix of $G$. These graphs were first studied by Steinerberger in the context of a notion of discrete curvature (``Curvature on graphs via equilibrium measures,'' \\emph{Journ..."
      },
      {
        "title": "An Improved Quality Hierarchical Congestion Approximator in Near-Linear Time",
        "authors": [
          "Monika Henzinger",
          "Robin Münk",
          "Harald Räcke"
        ],
        "published": "2025-11-05",
        "link": "http://arxiv.org/abs/2511.03716v1",
        "summary": "A congestion approximator for a graph is a compact data structure that approximately predicts the edge congestion required to route any set of flow demands in a network. A congestion approximator is hierarchical if it consists of a laminar family of cuts in the graph. There is a tradeoff between the running time for computing a congestion approximator and its approximation quality. Currently, for ..."
      },
      {
        "title": "Echoes of the First Stars: Massive Star Evolution in Extremely Metal-Poor Environments with the Habitable Worlds Observatory",
        "authors": [
          "Peter Senchyna",
          "Calum Hawcroft",
          "Miriam Garcia",
          "Aida Wofford",
          "Janice C. Lee",
          "Chris Evans"
        ],
        "published": "2025-11-05",
        "link": "http://arxiv.org/abs/2511.03715v1",
        "summary": "A remarkable span of frontier astrophysics, from gravitational-wave archaeology to the origin of the elements to interpreting snapshots of the earliest galaxies, depends sensitively on our understanding of massive star formation and evolution in near-pristine, relatively enriched gas. From the surprisingly massive black holes detected by LIGO/Virgo to highly ionized nebulae with peculiar enrichmen..."
      },
      {
        "title": "Shrinking the Variance: Shrinkage Baselines for Reinforcement Learning with Verifiable Rewards",
        "authors": [
          "Guanning Zeng",
          "Zhaoyi Zhou",
          "Daman Arora",
          "Andrea Zanette"
        ],
        "published": "2025-11-05",
        "link": "http://arxiv.org/abs/2511.03710v1",
        "summary": "Reinforcement Learning with Verifiable Rewards (RLVR) has emerged as a powerful paradigm for post-training large reasoning models (LRMs) using policy-gradient methods such as GRPO. To stabilize training, these methods typically center trajectory rewards by subtracting the empirical mean for each prompt. Statistically, this centering acts as a control variate (or baseline), reducing the variance of..."
      },
      {
        "title": "Stellar Bounds on Light Spin-2 Particles in Bimetric Theories",
        "authors": [
          "Camilo García-Cely",
          "Andreas Ringwald"
        ],
        "published": "2025-11-05",
        "link": "http://arxiv.org/abs/2511.03707v1",
        "summary": "Using the bimetric formalism, we compute the production and emission rates of light spin-2 particles in non-degenerate stellar interiors through photoproduction and bremsstrahlung processes, including the effects of plasma screening. By comparing the resulting energy-loss rates with observational limits on stellar cooling, we derive bounds on the coupling strength and mass of the spin-2 particle. ..."
      },
      {
        "title": "Long-Lasting and Slowly Varying Transient Dynamics in Discrete-Time Systems",
        "authors": [
          "Anthony Pasion",
          "Felicia Magpantay"
        ],
        "published": "2025-11-05",
        "link": "http://arxiv.org/abs/2511.03704v1",
        "summary": "Analysis of mathematical models in ecology and epidemiology often focuses on asymptotic dynamics, such as stable equilibria and periodic orbits. However, many systems exhibit long transient behaviors where certain aspects of the dynamics remain in a slowly evolving state for an extended period before undergoing rapid change. In this work, we analyze long-lasting and slowly varying transient dynami..."
      },
      {
        "title": "A non-iterative straightening algorithm and orthogonality for skew Schur modules",
        "authors": [
          "Reuven Hodges",
          "Hanzhang Yin"
        ],
        "published": "2025-11-05",
        "link": "http://arxiv.org/abs/2511.03702v1",
        "summary": "We generalize Fulton's determinantal construction of Schur modules to the skew setting, providing an explicit and functorial presentation using only elementary linear algebra and determinantal identities, in parallel with the partition case. Building on the non-iterative straightening formula of the first author for partition shapes, we develop a non-iterative straightening algorithm for skew Schu..."
      },
      {
        "title": "Mean-field approach to finite-size fluctuations in the Kuramoto-Sakaguchi model",
        "authors": [
          "Oleh E. Omel'chenko",
          "Georg A. Gottwald"
        ],
        "published": "2025-11-05",
        "link": "http://arxiv.org/abs/2511.03700v1",
        "summary": "We develop an ab initio approach to describe the statistical behavior of finite-size fluctuations in the Kuramoto-Sakaguchi model. We obtain explicit expressions for the covariance function of fluctuations of the complex order parameter and determine the variance of its magnitude entirely in terms of the equation parameters. Our results rely on an explicit complex-valued formula for solutions of t..."
      },
      {
        "title": "An Extensible Julia Toolkit for Symmetry-Aware Dual Space Phasing in Arbitrary Dimensions",
        "authors": [
          "Pavel Kalugin"
        ],
        "published": "2025-11-05",
        "link": "http://arxiv.org/abs/2511.03698v1",
        "summary": "We present an open-source Julia-based software toolkit for solving the phase problem using dual-space iterative algorithms. The toolkit is specifically designed for aperiodic crystals and quasicrystals, supporting general space group symmetries in arbitrary dimensions. A key feature is the symmetry-breaking anti-aliasing sampling scheme, optimized for computational efficiency when working with str..."
      },
      {
        "title": "AnaFlow: Agentic LLM-based Workflow for Reasoning-Driven Explainable and Sample-Efficient Analog Circuit Sizing",
        "authors": [
          "Mohsen Ahmadzadeh",
          "Kaichang Chen",
          "Georges Gielen"
        ],
        "published": "2025-11-05",
        "link": "http://arxiv.org/abs/2511.03697v1",
        "summary": "Analog/mixed-signal circuits are key for interfacing electronics with the physical world. Their design, however, remains a largely handcrafted process, resulting in long and error-prone design cycles. While the recent rise of AI-based reinforcement learning and generative AI has created new techniques to automate this task, the need for many time-consuming simulations is a critical bottleneck hind..."
      },
      {
        "title": "Robust Global Fr'echet Regression via Weight Regularization",
        "authors": [
          "Hao Li",
          "Shonosuke Sugasawa",
          "Shota Katayama"
        ],
        "published": "2025-11-05",
        "link": "http://arxiv.org/abs/2511.03694v1",
        "summary": "The Fr\\'echet regression is a useful method for modeling random objects in a general metric space given Euclidean covariates. However, the conventional approach could be sensitive to outlying objects in the sense that the distance from the regression surface is large compared to the other objects. In this study, we develop a robust version of the global Fr\\'echet regression by incorporating weight..."
      },
      {
        "title": "Colorectal Cancer Histopathological Grading using Multi-Scale Federated Learning",
        "authors": [
          "Md Ahasanul Arafath",
          "Abhijit Kumar Ghosh",
          "Md Rony Ahmed",
          "Sabrin Afroz",
          "Minhazul Hosen",
          "Md Hasan Moon",
          "Md Tanzim Reza",
          "Md Ashad Alam"
        ],
        "published": "2025-11-05",
        "link": "http://arxiv.org/abs/2511.03693v1",
        "summary": "Colorectal cancer (CRC) grading is a critical prognostic factor but remains hampered by inter-observer variability and the privacy constraints of multi-institutional data sharing. While deep learning offers a path to automation, centralized training models conflict with data governance regulations and neglect the diagnostic importance of multi-scale analysis. In this work, we propose a scalable, p..."
      },
      {
        "title": "Certified randomness amplification by dynamically probing remote random quantum states",
        "authors": [
          "Minzhao Liu",
          "Pradeep Niroula",
          "Matthew DeCross",
          "Cameron Foreman",
          "Wen Yu Kon",
          "Ignatius William Primaatmaja",
          "M. S. Allman",
          "J. P. Campora III",
          "Akhil Isanaka",
          "Kartik Singhal",
          "Omar Amer",
          "Shouvanik Chakrabarti",
          "Kaushik Chakraborty",
          "Samuel F. Cooper",
          "Robert D. Delaney",
          "Joan M. Dreiling",
          "Brian Estey",
          "Caroline Figgatt",
          "Cameron Foltz",
          "John P. Gaebler",
          "Alex Hall",
          "Zichang He",
          "Craig A. Holliman",
          "Travis S. Humble",
          "Shih-Han Hung",
          "Ali A. Husain",
          "Yuwei Jin",
          "Fatih Kaleoglu",
          "Colin J. Kennedy",
          "Nikhil Kotibhaskar",
          "Nathan K. Lysne",
          "Ivaylo S. Madjarov",
          "Michael Mills",
          "Alistair R. Milne",
          "Kevin Milner",
          "Louis Narmour",
          "Sivaprasad Omanakuttan",
          "Annie J. Park",
          "Michael A. Perlin",
          "Adam P. Reed",
          "Chris N. Self",
          "Matthew Steinberg",
          "David T. Stephen",
          "Joseph Sullivan",
          "Alex Chernoguzov",
          "Florian J. Curchod",
          "Anthony Ransford",
          "Justin G. Bohnet",
          "Brian Neyenhuis",
          "Michael Foss-Feig",
          "Rob Otter",
          "Ruslan Shaydulin"
        ],
        "published": "2025-11-05",
        "link": "http://arxiv.org/abs/2511.03686v1",
        "summary": "Cryptography depends on truly unpredictable numbers, but physical sources emit biased or correlated bits. Quantum mechanics enables the amplification of imperfect randomness into nearly perfect randomness, but prior demonstrations have required physically co-located, loophole-free Bell tests, constraining the feasibility of remote operation. Here we realize certified randomness amplification acros..."
      },
      {
        "title": "Efficient GPU Parallelization of Electronic Transport and Nonequilibrium Dynamics from Electron-Phonon Interactions in the Perturbo Code",
        "authors": [
          "Shiyu Peng",
          "Donnie Pinkston",
          "Jia Yao",
          "Sergei Kliavinek",
          "Ivan Maliyov",
          "Marco Bernardi"
        ],
        "published": "2025-11-05",
        "link": "http://arxiv.org/abs/2511.03683v1",
        "summary": "The Boltzmann transport equation (BTE) with electron-phonon (e-ph) interactions computed from first principles is widely used to study electronic transport and nonequilibrium dynamics in materials. Calculating the e-ph collision integral is the most important step in the BTE, but it remains computationally costly, even with current MPI+OpenMP parallelization. This challenge makes it difficult to s..."
      }
    ],
    "Computer Vision": [
      {
        "title": "Disentangled Concepts Speak Louder Than Words:Explainable Video Action Recognition",
        "authors": [
          "Jongseo Lee",
          "Wooil Lee",
          "Gyeong-Moon Park",
          "Seong Tae Kim",
          "Jinwoo Choi"
        ],
        "published": "2025-11-05",
        "link": "http://arxiv.org/abs/2511.03725v1",
        "summary": "Effective explanations of video action recognition models should disentangle how movements unfold over time from the surrounding spatial context. However, existing methods based on saliency produce entangled explanations, making it unclear whether predictions rely on motion or spatial context. Language-based approaches offer structure but often fail to explain motions due to their tacit nature -- ..."
      },
      {
        "title": "High-order Accumulative Regularization for Gradient Minimization in Convex Programming",
        "authors": [
          "Yao Ji",
          "Guanghui Lan"
        ],
        "published": "2025-11-05",
        "link": "http://arxiv.org/abs/2511.03723v1",
        "summary": "This paper develops a unified framework of high-order accumulative regularization (AR) framework for convex and uniformly convex gradient norm minimization. Existing high-order methods often exhibit a gap: the function value residual decreases fast, while the gradient norm converges much slower. To close this gap, we introduce AR that systematically transforms fast function value residual converge..."
      },
      {
        "title": "Grounded Misunderstandings in Asymmetric Dialogue: A Perspectivist Annotation Scheme for MapTask",
        "authors": [
          "Nan Li",
          "Albert Gatt",
          "Massimo Poesio"
        ],
        "published": "2025-11-05",
        "link": "http://arxiv.org/abs/2511.03718v1",
        "summary": "Collaborative dialogue relies on participants incrementally establishing common ground, yet in asymmetric settings they may believe they agree while referring to different entities. We introduce a perspectivist annotation scheme for the HCRC MapTask corpus (Anderson et al., 1991) that separately captures speaker and addressee grounded interpretations for each reference expression, enabling us to t..."
      },
      {
        "title": "An Improved Quality Hierarchical Congestion Approximator in Near-Linear Time",
        "authors": [
          "Monika Henzinger",
          "Robin Münk",
          "Harald Räcke"
        ],
        "published": "2025-11-05",
        "link": "http://arxiv.org/abs/2511.03716v1",
        "summary": "A congestion approximator for a graph is a compact data structure that approximately predicts the edge congestion required to route any set of flow demands in a network. A congestion approximator is hierarchical if it consists of a laminar family of cuts in the graph. There is a tradeoff between the running time for computing a congestion approximator and its approximation quality. Currently, for ..."
      },
      {
        "title": "Multi-Region Matrix Interpolation for Dynamic Analysis of Aperiodic Structures under Large Model Parameter Perturbations",
        "authors": [
          "J. Pereira",
          "R. O. Ruiz"
        ],
        "published": "2025-11-05",
        "link": "http://arxiv.org/abs/2511.03711v1",
        "summary": "This work introduces a surrogate-based model for efficiently estimating the frequency response of dynamic mechanical metamaterials, particularly when dealing with large parametric perturbations and aperiodic substructures. The research builds upon a previous matrix interpolation method applied on top of a Craig-Bampton modal reduction, allowing the variations of geometrical features without the ne..."
      },
      {
        "title": "Shrinking the Variance: Shrinkage Baselines for Reinforcement Learning with Verifiable Rewards",
        "authors": [
          "Guanning Zeng",
          "Zhaoyi Zhou",
          "Daman Arora",
          "Andrea Zanette"
        ],
        "published": "2025-11-05",
        "link": "http://arxiv.org/abs/2511.03710v1",
        "summary": "Reinforcement Learning with Verifiable Rewards (RLVR) has emerged as a powerful paradigm for post-training large reasoning models (LRMs) using policy-gradient methods such as GRPO. To stabilize training, these methods typically center trajectory rewards by subtracting the empirical mean for each prompt. Statistically, this centering acts as a control variate (or baseline), reducing the variance of..."
      },
      {
        "title": "Stellar Bounds on Light Spin-2 Particles in Bimetric Theories",
        "authors": [
          "Camilo García-Cely",
          "Andreas Ringwald"
        ],
        "published": "2025-11-05",
        "link": "http://arxiv.org/abs/2511.03707v1",
        "summary": "Using the bimetric formalism, we compute the production and emission rates of light spin-2 particles in non-degenerate stellar interiors through photoproduction and bremsstrahlung processes, including the effects of plasma screening. By comparing the resulting energy-loss rates with observational limits on stellar cooling, we derive bounds on the coupling strength and mass of the spin-2 particle. ..."
      },
      {
        "title": "Ideals, Gröbner Bases, and PCPs",
        "authors": [
          "Prashanth Amireddy",
          "Amik Raj Behera",
          "Srikanth Srinivasan",
          "Madhu Sudan",
          "Sophus Valentin Willumsgaard"
        ],
        "published": "2025-11-05",
        "link": "http://arxiv.org/abs/2511.03703v1",
        "summary": "All known proofs of the PCP theorem rely on multiple \"composition\" steps, where PCPs over large alphabets are turned into PCPs over much smaller alphabets at a (relatively) small price in the soundness error of the PCP. Algebraic proofs, starting with the work of Arora, Lund, Motwani, Sudan, and Szegedy use at least 2 such composition steps, whereas the \"Gap amplification\" proof of Dinur uses $\\Th..."
      },
      {
        "title": "Two-loop form factors for Dark Matter annihilation to colored Standard Model particles",
        "authors": [
          "Warsimakram Katapur",
          "Ambresh Shivaji"
        ],
        "published": "2025-11-05",
        "link": "http://arxiv.org/abs/2511.03701v1",
        "summary": "We investigate a UV-complete model in which the dark matter (DM) particle interacts with gluons through a colored scalar mediator. This framework provides a phenomenologically viable scenario testable at hadron colliders. While mono-jet signatures are relevant for collider searches, zero-jet processes correspond to complete annihilation of Standard Model (SM) particles into DM, contributing to the..."
      },
      {
        "title": "Do Androids Dream of Unseen Puppeteers? Probing for a Conspiracy Mindset in Large Language Models",
        "authors": [
          "Francesco Corso",
          "Francesco Pierri",
          "Gianmarco De Francisci Morales"
        ],
        "published": "2025-11-05",
        "link": "http://arxiv.org/abs/2511.03699v1",
        "summary": "In this paper, we investigate whether Large Language Models (LLMs) exhibit conspiratorial tendencies, whether they display sociodemographic biases in this domain, and how easily they can be conditioned into adopting conspiratorial perspectives. Conspiracy beliefs play a central role in the spread of misinformation and in shaping distrust toward institutions, making them a critical testbed for eval..."
      },
      {
        "title": "An Extensible Julia Toolkit for Symmetry-Aware Dual Space Phasing in Arbitrary Dimensions",
        "authors": [
          "Pavel Kalugin"
        ],
        "published": "2025-11-05",
        "link": "http://arxiv.org/abs/2511.03698v1",
        "summary": "We present an open-source Julia-based software toolkit for solving the phase problem using dual-space iterative algorithms. The toolkit is specifically designed for aperiodic crystals and quasicrystals, supporting general space group symmetries in arbitrary dimensions. A key feature is the symmetry-breaking anti-aliasing sampling scheme, optimized for computational efficiency when working with str..."
      },
      {
        "title": "AnaFlow: Agentic LLM-based Workflow for Reasoning-Driven Explainable and Sample-Efficient Analog Circuit Sizing",
        "authors": [
          "Mohsen Ahmadzadeh",
          "Kaichang Chen",
          "Georges Gielen"
        ],
        "published": "2025-11-05",
        "link": "http://arxiv.org/abs/2511.03697v1",
        "summary": "Analog/mixed-signal circuits are key for interfacing electronics with the physical world. Their design, however, remains a largely handcrafted process, resulting in long and error-prone design cycles. While the recent rise of AI-based reinforcement learning and generative AI has created new techniques to automate this task, the need for many time-consuming simulations is a critical bottleneck hind..."
      },
      {
        "title": "Introducing Quantum Computing into Statistical Physics: Random Walks and the Ising Model with Qiskit",
        "authors": [
          "Zihan Li",
          "Dan A. Mazilu",
          "Irina Mazilu"
        ],
        "published": "2025-11-05",
        "link": "http://arxiv.org/abs/2511.03696v1",
        "summary": "Quantum computing offers a powerful new perspective on probabilistic and collective behaviors traditionally taught in statistical physics. This paper presents two classroom-ready modules that integrate quantum computing into the undergraduate curriculum using Qiskit: the quantum random walk and the Ising model. Both modules allow students to simulate and contrast classical and quantum systems, dee..."
      },
      {
        "title": "Robust Global Fr'echet Regression via Weight Regularization",
        "authors": [
          "Hao Li",
          "Shonosuke Sugasawa",
          "Shota Katayama"
        ],
        "published": "2025-11-05",
        "link": "http://arxiv.org/abs/2511.03694v1",
        "summary": "The Fr\\'echet regression is a useful method for modeling random objects in a general metric space given Euclidean covariates. However, the conventional approach could be sensitive to outlying objects in the sense that the distance from the regression surface is large compared to the other objects. In this study, we develop a robust version of the global Fr\\'echet regression by incorporating weight..."
      },
      {
        "title": "Improving Gene Trees without more data",
        "authors": [
          "Ashu Gupta"
        ],
        "published": "2025-11-05",
        "link": "http://arxiv.org/abs/2511.03692v1",
        "summary": "Estimating species and gene trees from sequence data is challenging. Gene tree estimation is often hampered by low phylogenetic signal in alignments, leading to inaccurate trees. Species tree estimation is complicated by incomplete lineage sorting (ILS), where gene histories differ from the species' history. Summary methods like MP-EST, ASTRAL2, and ASTRID infer species trees from gene trees but s..."
      }
    ]
  }
}