{
  "meta": {
    "last_update": "2025-11-01T08:37:28Z",
    "keywords": [
      "RAG",
      "Retrieval-Augmented Generation",
      "Computer Vision"
    ],
    "counts": {
      "RAG": 15,
      "Retrieval-Augmented Generation": 15,
      "Computer Vision": 15
    }
  },
  "data": {
    "RAG": [
      {
        "title": "SecureReviewer: Enhancing Large Language Models for Secure Code Review through Secure-aware Fine-tuning",
        "authors": [
          "Fang Liu",
          "Simiao Liu",
          "Yinghao Zhu",
          "Xiaoli Lian",
          "Li Zhang"
        ],
        "published": "2025-10-30",
        "link": "http://arxiv.org/abs/2510.26457v1",
        "summary": "Identifying and addressing security issues during the early phase of the development lifecycle is critical for mitigating the long-term negative impacts on software systems. Code review serves as an effective practice that enables developers to check their teammates' code before integration into the codebase. To streamline the generation of review comments, various automated code review approaches..."
      },
      {
        "title": "MisSynth: Improving MISSCI Logical Fallacies Classification with Synthetic Data",
        "authors": [
          "Mykhailo Poliakov",
          "Nadiya Shvai"
        ],
        "published": "2025-10-30",
        "link": "http://arxiv.org/abs/2510.26345v1",
        "summary": "Health-related misinformation is very prevalent and potentially harmful. It is difficult to identify, especially when claims distort or misinterpret scientific findings. We investigate the impact of synthetic data generation and lightweight fine-tuning techniques on the ability of large language models (LLMs) to recognize fallacious arguments using the MISSCI dataset and framework. In this work, w..."
      },
      {
        "title": "GraphCompliance: Aligning Policy and Context Graphs for LLM-Based Regulatory Compliance",
        "authors": [
          "Jiseong Chung",
          "Ronny Ko",
          "Wonchul Yoo",
          "Makoto Onizuka",
          "Sungmok Kim",
          "Tae-Wan Kim",
          "Won-Yong Shin"
        ],
        "published": "2025-10-30",
        "link": "http://arxiv.org/abs/2510.26309v1",
        "summary": "Compliance at web scale poses practical challenges: each request may require a regulatory assessment. Regulatory texts (e.g., the General Data Protection Regulation, GDPR) are cross-referential and normative, while runtime contexts are expressed in unstructured natural language. This setting motivates us to align semantic information in unstructured text with the structured, normative elements of ..."
      },
      {
        "title": "Retrieval Augmented Generation-Enhanced Distributed LLM Agents for Generalizable Traffic Signal Control with Emergency Vehicles",
        "authors": [
          "Xinhang Li",
          "Qing Guo",
          "Junyu Chen",
          "Zheng Guo",
          "Shengzhe Xu",
          "Lei Li",
          "Lin Zhang"
        ],
        "published": "2025-10-30",
        "link": "http://arxiv.org/abs/2510.26242v1",
        "summary": "With increasing urban traffic complexity, Traffic Signal Control (TSC) is essential for optimizing traffic flow and improving road safety. Large Language Models (LLMs) emerge as promising approaches for TSC. However, they are prone to hallucinations in emergencies, leading to unreliable decisions that may cause substantial delays for emergency vehicles. Moreover, diverse intersection types present..."
      },
      {
        "title": "Towards Global Retrieval Augmented Generation: A Benchmark for Corpus-Level Reasoning",
        "authors": [
          "Qi Luo",
          "Xiaonan Li",
          "Tingshuo Fan",
          "Xinchi Chen",
          "Xipeng Qiu"
        ],
        "published": "2025-10-30",
        "link": "http://arxiv.org/abs/2510.26205v1",
        "summary": "Retrieval-augmented generation (RAG) has emerged as a leading approach to reducing hallucinations in large language models (LLMs). Current RAG evaluation benchmarks primarily focus on what we call local RAG: retrieving relevant chunks from a small subset of documents to answer queries that require only localized understanding within specific text chunks. However, many real-world applications requi..."
      },
      {
        "title": "CRAG-MM: Multi-modal Multi-turn Comprehensive RAG Benchmark",
        "authors": [
          "Jiaqi Wang",
          "Xiao Yang",
          "Kai Sun",
          "Parth Suresh",
          "Sanat Sharma",
          "Adam Czyzewski",
          "Derek Andersen",
          "Surya Appini",
          "Arkav Banerjee",
          "Sajal Choudhary",
          "Shervin Ghasemlou",
          "Ziqiang Guan",
          "Akil Iyer",
          "Haidar Khan",
          "Lingkun Kong",
          "Roy Luo",
          "Tiffany Ma",
          "Zhen Qiao",
          "David Tran",
          "Wenfang Xu",
          "Skyler Yeatman",
          "Chen Zhou",
          "Gunveer Gujral",
          "Yinglong Xia",
          "Shane Moon",
          "Nicolas Scheffer",
          "Nirav Shah",
          "Eun Chang",
          "Yue Liu",
          "Florian Metze",
          "Tammy Stark",
          "Zhaleh Feizollahi",
          "Andrea Jessee",
          "Mangesh Pujari",
          "Ahmed Aly",
          "Babak Damavandi",
          "Rakesh Wanga",
          "Anuj Kumar",
          "Rohit Patel",
          "Wen-tau Yih",
          "Xin Luna Dong"
        ],
        "published": "2025-10-30",
        "link": "http://arxiv.org/abs/2510.26160v1",
        "summary": "Wearable devices such as smart glasses are transforming the way people interact with their surroundings, enabling users to seek information regarding entities in their view. Multi-Modal Retrieval-Augmented Generation (MM-RAG) plays a key role in supporting such questions, yet there is still no comprehensive benchmark for this task, especially regarding wearables scenarios. To fill this gap, we pre..."
      },
      {
        "title": "FARSIQA: Faithful and Advanced RAG System for Islamic Question Answering",
        "authors": [
          "Mohammad Aghajani Asl",
          "Behrooz Minaei Bidgoli"
        ],
        "published": "2025-10-29",
        "link": "http://arxiv.org/abs/2510.25621v1",
        "summary": "The advent of Large Language Models (LLMs) has revolutionized Natural Language Processing, yet their application in high-stakes, specialized domains like religious question answering is hindered by challenges like hallucination and unfaithfulness to authoritative sources. This issue is particularly critical for the Persian-speaking Muslim community, where accuracy and trustworthiness are paramount..."
      },
      {
        "title": "Retrieval Augmented Generation (RAG) for Fintech: Agentic Design and Evaluation",
        "authors": [
          "Thomas Cook",
          "Richard Osuagwu",
          "Liman Tsatiashvili",
          "Vrynsia Vrynsia",
          "Koustav Ghosal",
          "Maraim Masoud",
          "Riccardo Mattivi"
        ],
        "published": "2025-10-29",
        "link": "http://arxiv.org/abs/2510.25518v1",
        "summary": "Retrieval-Augmented Generation (RAG) systems often face limitations in specialized domains such as fintech, where domain-specific ontologies, dense terminology, and acronyms complicate effective retrieval and synthesis. This paper introduces an agentic RAG architecture designed to address these challenges through a modular pipeline of specialized agents. The proposed system supports intelligent qu..."
      },
      {
        "title": "DIRC-RAG: Accelerating Edge RAG with Robust High-Density and High-Loading-Bandwidth Digital In-ReRAM Computation",
        "authors": [
          "Kunming Shao",
          "Zhipeng Liao",
          "Jiangnan Yu",
          "Liang Zhao",
          "Qiwei Li",
          "Xijie Huang",
          "Jingyu He",
          "Fengshi Tian",
          "Yi Zou",
          "Xiaomeng Wang",
          "Tim Kwang-Ting Cheng",
          "Chi-Ying Tsui"
        ],
        "published": "2025-10-29",
        "link": "http://arxiv.org/abs/2510.25278v1",
        "summary": "Retrieval-Augmented Generation (RAG) enhances large language models (LLMs) by integrating external knowledge retrieval but faces challenges on edge devices due to high storage, energy, and latency demands. Computing-in-Memory (CIM) offers a promising solution by storing document embeddings in CIM macros and enabling in-situ parallel retrievals but is constrained by either low memory density or lim..."
      },
      {
        "title": "Secure Retrieval-Augmented Generation against Poisoning Attacks",
        "authors": [
          "Zirui Cheng",
          "Jikai Sun",
          "Anjun Gao",
          "Yueyang Quan",
          "Zhuqing Liu",
          "Xiaohua Hu",
          "Minghong Fang"
        ],
        "published": "2025-10-28",
        "link": "http://arxiv.org/abs/2510.25025v1",
        "summary": "Large language models (LLMs) have transformed natural language processing (NLP), enabling applications from content generation to decision support. Retrieval-Augmented Generation (RAG) improves LLMs by incorporating external knowledge but also introduces security risks, particularly from data poisoning, where the attacker injects poisoned texts into the knowledge database to manipulate system outp..."
      },
      {
        "title": "Seeing Through the MiRAGE: Evaluating Multimodal Retrieval Augmented Generation",
        "authors": [
          "Alexander Martin",
          "William Walden",
          "Reno Kriz",
          "Dengjia Zhang",
          "Kate Sanders",
          "Eugene Yang",
          "Chihsheng Jin",
          "Benjamin Van Durme"
        ],
        "published": "2025-10-28",
        "link": "http://arxiv.org/abs/2510.24870v1",
        "summary": "We introduce MiRAGE, an evaluation framework for retrieval-augmented generation (RAG) from multimodal sources. As audiovisual media becomes a prevalent source of information online, it is essential for RAG systems to integrate information from these sources into generation. However, existing evaluations for RAG are text-centric, limiting their applicability to multimodal, reasoning intensive setti..."
      },
      {
        "title": "Optimizing Retrieval for RAG via Reinforced Contrastive Learning",
        "authors": [
          "Jiawei Zhou",
          "Lei Chen"
        ],
        "published": "2025-10-28",
        "link": "http://arxiv.org/abs/2510.24652v1",
        "summary": "As retrieval-augmented generation (RAG) becomes increasingly widespread, the role of information retrieval (IR) is shifting from retrieving information for human users to retrieving contextual knowledge for artificial intelligence (AI) systems, where relevance becomes difficult to define or annotate beforehand. To address this challenge, we propose R3, a Retrieval framework optimized for RAG throu..."
      },
      {
        "title": "Mitigating Hallucination in Large Language Models (LLMs): An Application-Oriented Survey on RAG, Reasoning, and Agentic Systems",
        "authors": [
          "Yihan Li",
          "Xiyuan Fu",
          "Ghanshyam Verma",
          "Paul Buitelaar",
          "Mingming Liu"
        ],
        "published": "2025-10-28",
        "link": "http://arxiv.org/abs/2510.24476v1",
        "summary": "Hallucination remains one of the key obstacles to the reliable deployment of large language models (LLMs), particularly in real-world applications. Among various mitigation strategies, Retrieval-Augmented Generation (RAG) and reasoning enhancement have emerged as two of the most effective and widely adopted approaches, marking a shift from merely suppressing hallucinations to balancing creativity ..."
      },
      {
        "title": "Metadata-Driven Retrieval-Augmented Generation for Financial Question Answering",
        "authors": [
          "Michail Dadopoulos",
          "Anestis Ladas",
          "Stratos Moschidis",
          "Ioannis Negkakis"
        ],
        "published": "2025-10-28",
        "link": "http://arxiv.org/abs/2510.24402v1",
        "summary": "Retrieval-Augmented Generation (RAG) struggles on long, structured financial filings where relevant evidence is sparse and cross-referenced. This paper presents a systematic investigation of advanced metadata-driven Retrieval-Augmented Generation (RAG) techniques, proposing and evaluating a novel, multi-stage RAG architecture that leverages LLM-generated metadata. We introduce a sophisticated inde..."
      },
      {
        "title": "Retrieval and Argumentation Enhanced Multi-Agent LLMs for Judgmental Forecasting",
        "authors": [
          "Deniz Gorur",
          "Antoni Rago",
          "Francesca Toni"
        ],
        "published": "2025-10-28",
        "link": "http://arxiv.org/abs/2510.24303v1",
        "summary": "Judgmental forecasting is the task of making predictions about future events based on human judgment. This task can be seen as a form of claim verification, where the claim corresponds to a future event and the task is to assess the plausibility of that event. In this paper, we propose a novel multi-agent framework for claim verification, whereby different agents may disagree on claim veracity and..."
      }
    ],
    "Retrieval-Augmented Generation": [
      {
        "title": "Are Video Models Ready as Zero-Shot Reasoners? An Empirical Study with the MME-CoF Benchmark",
        "authors": [
          "Ziyu Guo",
          "Xinyan Chen",
          "Renrui Zhang",
          "Ruichuan An",
          "Yu Qi",
          "Dongzhi Jiang",
          "Xiangtai Li",
          "Manyuan Zhang",
          "Hongsheng Li",
          "Pheng-Ann Heng"
        ],
        "published": "2025-10-30",
        "link": "http://arxiv.org/abs/2510.26802v1",
        "summary": "Recent video generation models can produce high-fidelity, temporally coherent videos, indicating that they may encode substantial world knowledge. Beyond realistic synthesis, they also exhibit emerging behaviors indicative of visual perception, modeling, and manipulation. Yet, an important question still remains: Are video models ready to serve as zero-shot reasoners in challenging visual reasonin..."
      },
      {
        "title": "OmniX: From Unified Panoramic Generation and Perception to Graphics-Ready 3D Scenes",
        "authors": [
          "Yukun Huang",
          "Jiwen Yu",
          "Yanning Zhou",
          "Jianan Wang",
          "Xintao Wang",
          "Pengfei Wan",
          "Xihui Liu"
        ],
        "published": "2025-10-30",
        "link": "http://arxiv.org/abs/2510.26800v1",
        "summary": "There are two prevalent ways to constructing 3D scenes: procedural generation and 2D lifting. Among them, panorama-based 2D lifting has emerged as a promising technique, leveraging powerful 2D generative priors to produce immersive, realistic, and diverse 3D environments. In this work, we advance this technique to generate graphics-ready 3D scenes suitable for physically based rendering (PBR), rel..."
      },
      {
        "title": "Cavity-assisted single-shot T center spin readout",
        "authors": [
          "Yu-En Wong",
          "Songtao Chen"
        ],
        "published": "2025-10-30",
        "link": "http://arxiv.org/abs/2510.26797v1",
        "summary": "High-fidelity spin readout is a crucial component for quantum information processing with optically interfaced solid-state spins. Here, we propose and investigate two theoretical protocols for fast single-shot readout of cavity-coupled single T center electronic spins. For fluorescence-based readout, we selectively couple one of the T center spin-conserving transitions to a single-mode photonic ca..."
      },
      {
        "title": "SEE4D: Pose-Free 4D Generation via Auto-Regressive Video Inpainting",
        "authors": [
          "Dongyue Lu",
          "Ao Liang",
          "Tianxin Huang",
          "Xiao Fu",
          "Yuyang Zhao",
          "Baorui Ma",
          "Liang Pan",
          "Wei Yin",
          "Lingdong Kong",
          "Wei Tsang Ooi",
          "Ziwei Liu"
        ],
        "published": "2025-10-30",
        "link": "http://arxiv.org/abs/2510.26796v1",
        "summary": "Immersive applications call for synthesizing spatiotemporal 4D content from casual videos without costly 3D supervision. Existing video-to-4D methods typically rely on manually annotated camera poses, which are labor-intensive and brittle for in-the-wild footage. Recent warp-then-inpaint approaches mitigate the need for pose labels by warping input frames along a novel camera trajectory and using ..."
      },
      {
        "title": "The Quest for Generalizable Motion Generation: Data, Model, and Evaluation",
        "authors": [
          "Jing Lin",
          "Ruisi Wang",
          "Junzhe Lu",
          "Ziqi Huang",
          "Guorui Song",
          "Ailing Zeng",
          "Xian Liu",
          "Chen Wei",
          "Wanqi Yin",
          "Qingping Sun",
          "Zhongang Cai",
          "Lei Yang",
          "Ziwei Liu"
        ],
        "published": "2025-10-30",
        "link": "http://arxiv.org/abs/2510.26794v1",
        "summary": "Despite recent advances in 3D human motion generation (MoGen) on standard benchmarks, existing models still face a fundamental bottleneck in their generalization capability. In contrast, adjacent generative fields, most notably video generation (ViGen), have demonstrated remarkable generalization in modeling human behaviors, highlighting transferable insights that MoGen can leverage. Motivated by ..."
      },
      {
        "title": "Learning Pseudorandom Numbers with Transformers: Permuted Congruential Generators, Curricula, and Interpretability",
        "authors": [
          "Tao Tao",
          "Maissam Barkeshli"
        ],
        "published": "2025-10-30",
        "link": "http://arxiv.org/abs/2510.26792v1",
        "summary": "We study the ability of Transformer models to learn sequences generated by Permuted Congruential Generators (PCGs), a widely used family of pseudo-random number generators (PRNGs). PCGs introduce substantial additional difficulty over linear congruential generators (LCGs) by applying a series of bit-wise shifts, XORs, rotations and truncations to the hidden state. We show that Transformers can nev..."
      },
      {
        "title": "Gistify! Codebase-Level Understanding via Runtime Execution",
        "authors": [
          "Hyunji Lee",
          "Minseon Kim",
          "Chinmay Singh",
          "Matheus Pereira",
          "Atharv Sonwane",
          "Isadora White",
          "Elias Stengel-Eskin",
          "Mohit Bansal",
          "Zhengyan Shi",
          "Alessandro Sordoni",
          "Marc-Alexandre Côté",
          "Xingdi Yuan",
          "Lucas Caccia"
        ],
        "published": "2025-10-30",
        "link": "http://arxiv.org/abs/2510.26790v1",
        "summary": "As coding agents are increasingly deployed in large codebases, the need to automatically design challenging, codebase-level evaluation is central. We propose Gistify, a task where a coding LLM must create a single, minimal, self-contained file that can reproduce a specific functionality of a codebase. The coding LLM is given full access to a codebase along with a specific entrypoint (e.g., a pytho..."
      },
      {
        "title": "Entanglement-assisted circuit knitting",
        "authors": [
          "Shao-Hua Hu",
          "Po-Sung Liu",
          "Jun-Yi Wu"
        ],
        "published": "2025-10-30",
        "link": "http://arxiv.org/abs/2510.26789v1",
        "summary": "Distributed quantum computing (DQC) provides a promising route toward scalable quantum computation, where entanglement-assisted LOCC and circuit knitting represent two complementary approaches. The former deterministically realizes nonlocal operations but demands extensive entanglement resources, whereas the latter requires no entanglement yet suffers from exponential sampling overhead. Here, we p..."
      },
      {
        "title": "HEIR: Learning Graph-Based Motion Hierarchies",
        "authors": [
          "Cheng Zheng",
          "William Koch",
          "Baiang Li",
          "Felix Heide"
        ],
        "published": "2025-10-30",
        "link": "http://arxiv.org/abs/2510.26786v1",
        "summary": "Hierarchical structures of motion exist across research fields, including computer vision, graphics, and robotics, where complex dynamics typically arise from coordinated interactions among simpler motion components. Existing methods to model such dynamics typically rely on manually-defined or heuristic hierarchies with fixed motion primitives, limiting their generalizability across different task..."
      },
      {
        "title": "LLMs Process Lists With General Filter Heads",
        "authors": [
          "Arnab Sen Sharma",
          "Giordano Rogers",
          "Natalie Shapira",
          "David Bau"
        ],
        "published": "2025-10-30",
        "link": "http://arxiv.org/abs/2510.26784v1",
        "summary": "We investigate the mechanisms underlying a range of list-processing tasks in LLMs, and we find that LLMs have learned to encode a compact, causal representation of a general filtering operation that mirrors the generic \"filter\" function of functional programming. Using causal mediation analysis on a diverse set of list-processing tasks, we find that a small number of attention heads, which we dub ..."
      },
      {
        "title": "Clone Deterministic 3D Worlds with Geometrically-Regularized World Models",
        "authors": [
          "Zaishuo Xia",
          "Yukuan Lu",
          "Xinyi Li",
          "Yifan Xu",
          "Yubei Chen"
        ],
        "published": "2025-10-30",
        "link": "http://arxiv.org/abs/2510.26782v1",
        "summary": "A world model is an internal model that simulates how the world evolves. Given past observations and actions, it predicts the future of both the embodied agent and its environment. Accurate world models are essential for enabling agents to think, plan, and reason effectively in complex, dynamic settings. Despite rapid progress, current world models remain brittle and degrade over long horizons. We..."
      },
      {
        "title": "Pre-trained Forecasting Models: Strong Zero-Shot Feature Extractors for Time Series Classification",
        "authors": [
          "Andreas Auer",
          "Daniel Klotz",
          "Sebastinan Böck",
          "Sepp Hochreiter"
        ],
        "published": "2025-10-30",
        "link": "http://arxiv.org/abs/2510.26777v1",
        "summary": "Recent research on time series foundation models has primarily focused on forecasting, leaving it unclear how generalizable their learned representations are. In this study, we examine whether frozen pre-trained forecasting models can provide effective representations for classification. To this end, we compare different representation extraction strategies and introduce two model-agnostic embeddi..."
      },
      {
        "title": "Automated event generation for S-wave quarkonium and leptonium production in NRQCD and NRQED",
        "authors": [
          "Alice Colpani Serri",
          "Chris A. Flett",
          "Jean-Philippe Lansberg",
          "Olivier Mattelaer",
          "Hua-Sheng Shao",
          "Lukas Simon"
        ],
        "published": "2025-10-30",
        "link": "http://arxiv.org/abs/2510.26773v1",
        "summary": "We present an extension of the MadGraph5_aMC@NLO framework that enables the automated calculation of leading-order cross sections for S-wave quarkonium and leptonium production within the non-relativistic QCD (NRQCD) and non-relativistic QED (NRQED) factorisation formalisms. The framework has been validated against a variety of benchmark processes, demonstrating robustness and flexibility for phen..."
      },
      {
        "title": "Charged Rotating Black Hole and the First Law",
        "authors": [
          "S. D Campos"
        ],
        "published": "2025-10-30",
        "link": "http://arxiv.org/abs/2510.26772v1",
        "summary": "The thermodynamic properties of black holes have been extensively studied through analogies with classical systems, revealing fundamental connections between gravitation, entropy, and quantum mechanics. In this work, we extend the thermodynamic framework of black holes by incorporating charge and analyzing its role in entropy production. Using an analogy with charged rotating soap bubbles, we demo..."
      },
      {
        "title": "STaMP: Sequence Transformation and Mixed Precision for Low-Precision Activation Quantization",
        "authors": [
          "Marco Federici",
          "Riccardo Del Chiaro",
          "Boris van Breugel",
          "Paul Whatmough",
          "Markus Nagel"
        ],
        "published": "2025-10-30",
        "link": "http://arxiv.org/abs/2510.26771v1",
        "summary": "Quantization is the key method for reducing inference latency, power and memory footprint of generative AI models. However, accuracy often degrades sharply when activations are quantized below eight bits. Recent work suggests that invertible linear transformations (e.g. rotations) can aid quantization, by reparameterizing feature channels and weights. In this paper, we propose \\textit{Sequence Tra..."
      }
    ],
    "Computer Vision": [
      {
        "title": "Are Video Models Ready as Zero-Shot Reasoners? An Empirical Study with the MME-CoF Benchmark",
        "authors": [
          "Ziyu Guo",
          "Xinyan Chen",
          "Renrui Zhang",
          "Ruichuan An",
          "Yu Qi",
          "Dongzhi Jiang",
          "Xiangtai Li",
          "Manyuan Zhang",
          "Hongsheng Li",
          "Pheng-Ann Heng"
        ],
        "published": "2025-10-30",
        "link": "http://arxiv.org/abs/2510.26802v1",
        "summary": "Recent video generation models can produce high-fidelity, temporally coherent videos, indicating that they may encode substantial world knowledge. Beyond realistic synthesis, they also exhibit emerging behaviors indicative of visual perception, modeling, and manipulation. Yet, an important question still remains: Are video models ready to serve as zero-shot reasoners in challenging visual reasonin..."
      },
      {
        "title": "OmniX: From Unified Panoramic Generation and Perception to Graphics-Ready 3D Scenes",
        "authors": [
          "Yukun Huang",
          "Jiwen Yu",
          "Yanning Zhou",
          "Jianan Wang",
          "Xintao Wang",
          "Pengfei Wan",
          "Xihui Liu"
        ],
        "published": "2025-10-30",
        "link": "http://arxiv.org/abs/2510.26800v1",
        "summary": "There are two prevalent ways to constructing 3D scenes: procedural generation and 2D lifting. Among them, panorama-based 2D lifting has emerged as a promising technique, leveraging powerful 2D generative priors to produce immersive, realistic, and diverse 3D environments. In this work, we advance this technique to generate graphics-ready 3D scenes suitable for physically based rendering (PBR), rel..."
      },
      {
        "title": "Masked Diffusion Captioning for Visual Feature Learning",
        "authors": [
          "Chao Feng",
          "Zihao Wei",
          "Andrew Owens"
        ],
        "published": "2025-10-30",
        "link": "http://arxiv.org/abs/2510.26799v1",
        "summary": "We learn visual features by captioning images with an image-conditioned masked diffusion language model, a formulation we call masked diffusion captioning (MDC). During training, text tokens in each image-caption pair are masked at a randomly chosen ratio, and a decoder conditioned on visual features is trained to reconstruct the original text. After training, the learned visual features can be ap..."
      },
      {
        "title": "SEE4D: Pose-Free 4D Generation via Auto-Regressive Video Inpainting",
        "authors": [
          "Dongyue Lu",
          "Ao Liang",
          "Tianxin Huang",
          "Xiao Fu",
          "Yuyang Zhao",
          "Baorui Ma",
          "Liang Pan",
          "Wei Yin",
          "Lingdong Kong",
          "Wei Tsang Ooi",
          "Ziwei Liu"
        ],
        "published": "2025-10-30",
        "link": "http://arxiv.org/abs/2510.26796v1",
        "summary": "Immersive applications call for synthesizing spatiotemporal 4D content from casual videos without costly 3D supervision. Existing video-to-4D methods typically rely on manually annotated camera poses, which are labor-intensive and brittle for in-the-wild footage. Recent warp-then-inpaint approaches mitigate the need for pose labels by warping input frames along a novel camera trajectory and using ..."
      },
      {
        "title": "Scaling Image Geo-Localization to Continent Level",
        "authors": [
          "Philipp Lindenberger",
          "Paul-Edouard Sarlin",
          "Jan Hosang",
          "Matteo Balice",
          "Marc Pollefeys",
          "Simon Lynen",
          "Eduard Trulls"
        ],
        "published": "2025-10-30",
        "link": "http://arxiv.org/abs/2510.26795v1",
        "summary": "Determining the precise geographic location of an image at a global scale remains an unsolved challenge. Standard image retrieval techniques are inefficient due to the sheer volume of images (>100M) and fail when coverage is insufficient. Scalable solutions, however, involve a trade-off: global classification typically yields coarse results (10+ kilometers), while cross-view retrieval between grou..."
      },
      {
        "title": "The Quest for Generalizable Motion Generation: Data, Model, and Evaluation",
        "authors": [
          "Jing Lin",
          "Ruisi Wang",
          "Junzhe Lu",
          "Ziqi Huang",
          "Guorui Song",
          "Ailing Zeng",
          "Xian Liu",
          "Chen Wei",
          "Wanqi Yin",
          "Qingping Sun",
          "Zhongang Cai",
          "Lei Yang",
          "Ziwei Liu"
        ],
        "published": "2025-10-30",
        "link": "http://arxiv.org/abs/2510.26794v1",
        "summary": "Despite recent advances in 3D human motion generation (MoGen) on standard benchmarks, existing models still face a fundamental bottleneck in their generalization capability. In contrast, adjacent generative fields, most notably video generation (ViGen), have demonstrated remarkable generalization in modeling human behaviors, highlighting transferable insights that MoGen can leverage. Motivated by ..."
      },
      {
        "title": "Gistify! Codebase-Level Understanding via Runtime Execution",
        "authors": [
          "Hyunji Lee",
          "Minseon Kim",
          "Chinmay Singh",
          "Matheus Pereira",
          "Atharv Sonwane",
          "Isadora White",
          "Elias Stengel-Eskin",
          "Mohit Bansal",
          "Zhengyan Shi",
          "Alessandro Sordoni",
          "Marc-Alexandre Côté",
          "Xingdi Yuan",
          "Lucas Caccia"
        ],
        "published": "2025-10-30",
        "link": "http://arxiv.org/abs/2510.26790v1",
        "summary": "As coding agents are increasingly deployed in large codebases, the need to automatically design challenging, codebase-level evaluation is central. We propose Gistify, a task where a coding LLM must create a single, minimal, self-contained file that can reproduce a specific functionality of a codebase. The coding LLM is given full access to a codebase along with a specific entrypoint (e.g., a pytho..."
      },
      {
        "title": "Entanglement-assisted circuit knitting",
        "authors": [
          "Shao-Hua Hu",
          "Po-Sung Liu",
          "Jun-Yi Wu"
        ],
        "published": "2025-10-30",
        "link": "http://arxiv.org/abs/2510.26789v1",
        "summary": "Distributed quantum computing (DQC) provides a promising route toward scalable quantum computation, where entanglement-assisted LOCC and circuit knitting represent two complementary approaches. The former deterministically realizes nonlocal operations but demands extensive entanglement resources, whereas the latter requires no entanglement yet suffers from exponential sampling overhead. Here, we p..."
      },
      {
        "title": "Defeating the Training-Inference Mismatch via FP16",
        "authors": [
          "Penghui Qi",
          "Zichen Liu",
          "Xiangxin Zhou",
          "Tianyu Pang",
          "Chao Du",
          "Wee Sun Lee",
          "Min Lin"
        ],
        "published": "2025-10-30",
        "link": "http://arxiv.org/abs/2510.26788v1",
        "summary": "Reinforcement learning (RL) fine-tuning of large language models (LLMs) often suffers from instability due to the numerical mismatch between the training and inference policies. While prior work has attempted to mitigate this issue through algorithmic corrections or engineering alignments, we show that its root cause lies in the floating point precision itself. The widely adopted BF16, despite its..."
      },
      {
        "title": "Remote Labor Index: Measuring AI Automation of Remote Work",
        "authors": [
          "Mantas Mazeika",
          "Alice Gatti",
          "Cristina Menghini",
          "Udari Madhushani Sehwag",
          "Shivam Singhal",
          "Yury Orlovskiy",
          "Steven Basart",
          "Manasi Sharma",
          "Denis Peskoff",
          "Elaine Lau",
          "Jaehyuk Lim",
          "Lachlan Carroll",
          "Alice Blair",
          "Vinaya Sivakumar",
          "Sumana Basu",
          "Brad Kenstler",
          "Yuntao Ma",
          "Julian Michael",
          "Xiaoke Li",
          "Oliver Ingebretsen",
          "Aditya Mehta",
          "Jean Mottola",
          "John Teichmann",
          "Kevin Yu",
          "Zaina Shaik",
          "Adam Khoja",
          "Richard Ren",
          "Jason Hausenloy",
          "Long Phan",
          "Ye Htet",
          "Ankit Aich",
          "Tahseen Rabbani",
          "Vivswan Shah",
          "Andriy Novykov",
          "Felix Binder",
          "Kirill Chugunov",
          "Luis Ramirez",
          "Matias Geralnik",
          "Hernán Mesura",
          "Dean Lee",
          "Ed-Yeremai Hernandez Cardona",
          "Annette Diamond",
          "Summer Yue",
          "Alexandr Wang",
          "Bing Liu",
          "Ernesto Hernandez",
          "Dan Hendrycks"
        ],
        "published": "2025-10-30",
        "link": "http://arxiv.org/abs/2510.26787v1",
        "summary": "AIs have made rapid progress on research-oriented benchmarks of knowledge and reasoning, but it remains unclear how these gains translate into economic value and automation. To measure this, we introduce the Remote Labor Index (RLI), a broadly multi-sector benchmark comprising real-world, economically valuable projects designed to evaluate end-to-end agent performance in practical settings. AI age..."
      },
      {
        "title": "HEIR: Learning Graph-Based Motion Hierarchies",
        "authors": [
          "Cheng Zheng",
          "William Koch",
          "Baiang Li",
          "Felix Heide"
        ],
        "published": "2025-10-30",
        "link": "http://arxiv.org/abs/2510.26786v1",
        "summary": "Hierarchical structures of motion exist across research fields, including computer vision, graphics, and robotics, where complex dynamics typically arise from coordinated interactions among simpler motion components. Existing methods to model such dynamics typically rely on manually-defined or heuristic hierarchies with fixed motion primitives, limiting their generalizability across different task..."
      },
      {
        "title": "LLMs Process Lists With General Filter Heads",
        "authors": [
          "Arnab Sen Sharma",
          "Giordano Rogers",
          "Natalie Shapira",
          "David Bau"
        ],
        "published": "2025-10-30",
        "link": "http://arxiv.org/abs/2510.26784v1",
        "summary": "We investigate the mechanisms underlying a range of list-processing tasks in LLMs, and we find that LLMs have learned to encode a compact, causal representation of a general filtering operation that mirrors the generic \"filter\" function of functional programming. Using causal mediation analysis on a diverse set of list-processing tasks, we find that a small number of attention heads, which we dub ..."
      },
      {
        "title": "Clone Deterministic 3D Worlds with Geometrically-Regularized World Models",
        "authors": [
          "Zaishuo Xia",
          "Yukuan Lu",
          "Xinyi Li",
          "Yifan Xu",
          "Yubei Chen"
        ],
        "published": "2025-10-30",
        "link": "http://arxiv.org/abs/2510.26782v1",
        "summary": "A world model is an internal model that simulates how the world evolves. Given past observations and actions, it predicts the future of both the embodied agent and its environment. Accurate world models are essential for enabling agents to think, plan, and reason effectively in complex, dynamic settings. Despite rapid progress, current world models remain brittle and degrade over long horizons. We..."
      },
      {
        "title": "ChartAB: A Benchmark for Chart Grounding & Dense Alignment",
        "authors": [
          "Aniruddh Bansal",
          "Davit Soselia",
          "Dang Nguyen",
          "Tianyi Zhou"
        ],
        "published": "2025-10-30",
        "link": "http://arxiv.org/abs/2510.26781v1",
        "summary": "Charts play an important role in visualization, reasoning, data analysis, and the exchange of ideas among humans. However, existing vision-language models (VLMs) still lack accurate perception of details and struggle to extract fine-grained structures from charts. Such limitations in chart grounding also hinder their ability to compare multiple charts and reason over them. In this paper, we introd..."
      },
      {
        "title": "Surpassing state of the art on AMD area estimation from RGB fundus images through careful selection of U-Net architectures and loss functions for class imbalance",
        "authors": [
          "Valentyna Starodub",
          "Mantas Lukoševičius"
        ],
        "published": "2025-10-30",
        "link": "http://arxiv.org/abs/2510.26778v1",
        "summary": "Age-related macular degeneration (AMD) is one of the leading causes of irreversible vision impairment in people over the age of 60. This research focuses on semantic segmentation for AMD lesion detection in RGB fundus images, a non-invasive and cost-effective imaging technique. The results of the ADAM challenge - the most comprehensive AMD detection from RGB fundus images research competition and ..."
      }
    ]
  }
}