{
  "meta": {
    "last_update": "2025-11-13T03:19:17Z",
    "keywords": [
      "RAG",
      "Retrieval-Augmented Generation",
      "Computer Vision"
    ],
    "counts": {
      "RAG": 15,
      "Retrieval-Augmented Generation": 15,
      "Computer Vision": 15
    }
  },
  "data": {
    "RAG": [
      {
        "title": "RAG-Gym: Systematic Optimization of Language Agents for Retrieval-Augmented Generation",
        "authors": [
          "Guangzhi Xiong",
          "Qiao Jin",
          "Xiao Wang",
          "Yin Fang",
          "Haolin Liu",
          "Yifan Yang",
          "Fangyuan Chen",
          "Zhixing Song",
          "Dengyu Wang",
          "Minjia Zhang",
          "Zhiyong Lu",
          "Aidong Zhang"
        ],
        "published": "2025-02-19",
        "link": "http://arxiv.org/abs/2502.13957v2",
        "summary": "Retrieval-augmented generation (RAG) has shown great promise for knowledge-intensive tasks and recently advanced with agentic RAG, where language agents engage in multi-round interactions with external knowledge sources for adaptive information retrieval. However, existing agentic RAG methods often depend on ad-hoc prompt engineering and lack a unified optimization framework. We introduce RAG-Gym,..."
      },
      {
        "title": "MultiHop-RAG: Benchmarking Retrieval-Augmented Generation for Multi-Hop Queries",
        "authors": [
          "Yixuan Tang",
          "Yi Yang"
        ],
        "published": "2024-01-27",
        "link": "http://arxiv.org/abs/2401.15391v1",
        "summary": "Retrieval-augmented generation (RAG) augments large language models (LLM) by retrieving relevant knowledge, showing promising potential in mitigating LLM hallucinations and enhancing response quality, thereby facilitating the great adoption of LLMs in practice. However, we find that existing RAG systems are inadequate in answering multi-hop queries, which require retrieving and reasoning over mult..."
      },
      {
        "title": "RAG-Star: Enhancing Deliberative Reasoning with Retrieval Augmented Verification and Refinement",
        "authors": [
          "Jinhao Jiang",
          "Jiayi Chen",
          "Junyi Li",
          "Ruiyang Ren",
          "Shijie Wang",
          "Wayne Xin Zhao",
          "Yang Song",
          "Tao Zhang"
        ],
        "published": "2024-12-17",
        "link": "http://arxiv.org/abs/2412.12881v1",
        "summary": "Existing large language models (LLMs) show exceptional problem-solving capabilities but might struggle with complex reasoning tasks. Despite the successes of chain-of-thought and tree-based search methods, they mainly depend on the internal knowledge of LLMs to search over intermediate reasoning steps, limited to dealing with simple tasks involving fewer reasoning steps. In this paper, we propose ..."
      },
      {
        "title": "T-RAG: Lessons from the LLM Trenches",
        "authors": [
          "Masoomali Fatehkia",
          "Ji Kim Lucas",
          "Sanjay Chawla"
        ],
        "published": "2024-02-12",
        "link": "http://arxiv.org/abs/2402.07483v2",
        "summary": "Large Language Models (LLM) have shown remarkable language capabilities fueling attempts to integrate them into applications across a wide range of domains. An important application area is question answering over private enterprise documents where the main considerations are data security, which necessitates applications that can be deployed on-prem, limited computational resources and the need f..."
      },
      {
        "title": "RAG over Tables: Hierarchical Memory Index, Multi-Stage Retrieval, and Benchmarking",
        "authors": [
          "Jiaru Zou",
          "Dongqi Fu",
          "Sirui Chen",
          "Xinrui He",
          "Zihao Li",
          "Yada Zhu",
          "Jiawei Han",
          "Jingrui He"
        ],
        "published": "2025-04-02",
        "link": "http://arxiv.org/abs/2504.01346v4",
        "summary": "Retrieval-Augmented Generation (RAG) enhances Large Language Models (LLMs) by integrating them with an external knowledge base to improve the answer relevance and accuracy. In real-world scenarios, beyond pure text, a substantial amount of knowledge is stored in tables, and user questions often require retrieving answers that are distributed across multiple tables. Retrieving knowledge from a tabl..."
      },
      {
        "title": "RAG based Question-Answering for Contextual Response Prediction System",
        "authors": [
          "Sriram Veturi",
          "Saurabh Vaichal",
          "Reshma Lal Jagadheesh",
          "Nafis Irtiza Tripto",
          "Nian Yan"
        ],
        "published": "2024-09-05",
        "link": "http://arxiv.org/abs/2409.03708v2",
        "summary": "Large Language Models (LLMs) have shown versatility in various Natural Language Processing (NLP) tasks, including their potential as effective question-answering systems. However, to provide precise and relevant information in response to specific customer queries in industry settings, LLMs require access to a comprehensive knowledge base to avoid hallucinations. Retrieval Augmented Generation (RA..."
      },
      {
        "title": "Retrieval Augmented Generation (RAG) for Fintech: Agentic Design and Evaluation",
        "authors": [
          "Thomas Cook",
          "Richard Osuagwu",
          "Liman Tsatiashvili",
          "Vrynsia Vrynsia",
          "Koustav Ghosal",
          "Maraim Masoud",
          "Riccardo Mattivi"
        ],
        "published": "2025-10-29",
        "link": "http://arxiv.org/abs/2510.25518v1",
        "summary": "Retrieval-Augmented Generation (RAG) systems often face limitations in specialized domains such as fintech, where domain-specific ontologies, dense terminology, and acronyms complicate effective retrieval and synthesis. This paper introduces an agentic RAG architecture designed to address these challenges through a modular pipeline of specialized agents. The proposed system supports intelligent qu..."
      },
      {
        "title": "Telco-RAG: Navigating the Challenges of Retrieval-Augmented Language Models for Telecommunications",
        "authors": [
          "Andrei-Laurentiu Bornea",
          "Fadhel Ayed",
          "Antonio De Domenico",
          "Nicola Piovesan",
          "Ali Maatouk"
        ],
        "published": "2024-04-24",
        "link": "http://arxiv.org/abs/2404.15939v3",
        "summary": "The application of Large Language Models (LLMs) and Retrieval-Augmented Generation (RAG) systems in the telecommunication domain presents unique challenges, primarily due to the complex nature of telecom standard documents and the rapid evolution of the field. The paper introduces Telco-RAG, an open-source RAG framework designed to handle the specific needs of telecommunications standards, particu..."
      },
      {
        "title": "Embodied-RAG: General Non-parametric Embodied Memory for Retrieval and Generation",
        "authors": [
          "Quanting Xie",
          "So Yeon Min",
          "Pengliang Ji",
          "Yue Yang",
          "Tianyi Zhang",
          "Kedi Xu",
          "Aarav Bajaj",
          "Ruslan Salakhutdinov",
          "Matthew Johnson-Roberson",
          "Yonatan Bisk"
        ],
        "published": "2024-09-26",
        "link": "http://arxiv.org/abs/2409.18313v5",
        "summary": "There is no limit to how much a robot might explore and learn, but all of that knowledge needs to be searchable and actionable. Within language research, retrieval augmented generation (RAG) has become the workhorse of large-scale non-parametric knowledge; however, existing techniques do not directly transfer to the embodied domain, which is multimodal, where data is highly correlated, and percept..."
      },
      {
        "title": "Fine-tune the Entire RAG Architecture (including DPR retriever) for Question-Answering",
        "authors": [
          "Shamane Siriwardhana",
          "Rivindu Weerasekera",
          "Elliott Wen",
          "Suranga Nanayakkara"
        ],
        "published": "2021-06-22",
        "link": "http://arxiv.org/abs/2106.11517v1",
        "summary": "In this paper, we illustrate how to fine-tune the entire Retrieval Augment Generation (RAG) architecture in an end-to-end manner. We highlighted the main engineering challenges that needed to be addressed to achieve this objective. We also compare how end-to-end RAG architecture outperforms the original RAG architecture for the task of question answering. We have open-sourced our implementation in..."
      },
      {
        "title": "From RAG to QA-RAG: Integrating Generative AI for Pharmaceutical Regulatory Compliance Process",
        "authors": [
          "Jaewoong Kim",
          "Moohong Min"
        ],
        "published": "2024-01-26",
        "link": "http://arxiv.org/abs/2402.01717v1",
        "summary": "Regulatory compliance in the pharmaceutical industry entails navigating through complex and voluminous guidelines, often requiring significant human resources. To address these challenges, our study introduces a chatbot model that utilizes generative AI and the Retrieval Augmented Generation (RAG) method. This chatbot is designed to search for guideline documents relevant to the user inquiries and..."
      },
      {
        "title": "Collab-RAG: Boosting Retrieval-Augmented Generation for Complex Question Answering via White-Box and Black-Box LLM Collaboration",
        "authors": [
          "Ran Xu",
          "Wenqi Shi",
          "Yuchen Zhuang",
          "Yue Yu",
          "Joyce C. Ho",
          "Haoyu Wang",
          "Carl Yang"
        ],
        "published": "2025-04-07",
        "link": "http://arxiv.org/abs/2504.04915v1",
        "summary": "Retrieval-Augmented Generation (RAG) systems often struggle to handle multi-hop question-answering tasks accurately due to irrelevant context retrieval and limited complex reasoning capabilities. We introduce Collab-RAG, a collaborative training framework that leverages mutual enhancement between a white-box small language model (SLM) and a blackbox large language model (LLM) for RAG. Specifically..."
      },
      {
        "title": "Vendi-RAG: Adaptively Trading-Off Diversity And Quality Significantly Improves Retrieval Augmented Generation With LLMs",
        "authors": [
          "Mohammad Reza Rezaei",
          "Adji Bousso Dieng"
        ],
        "published": "2025-02-16",
        "link": "http://arxiv.org/abs/2502.11228v2",
        "summary": "Retrieval-augmented generation (RAG) enhances large language models (LLMs) for domain-specific question-answering (QA) tasks by leveraging external knowledge sources. However, traditional RAG systems primarily focus on relevance-based retrieval and often struggle with redundancy, especially when reasoning requires connecting information from multiple sources. This paper introduces Vendi-RAG, a fra..."
      },
      {
        "title": "Auto-RAG: Autonomous Retrieval-Augmented Generation for Large Language Models",
        "authors": [
          "Tian Yu",
          "Shaolei Zhang",
          "Yang Feng"
        ],
        "published": "2024-11-29",
        "link": "http://arxiv.org/abs/2411.19443v1",
        "summary": "Iterative retrieval refers to the process in which the model continuously queries the retriever during generation to enhance the relevance of the retrieved knowledge, thereby improving the performance of Retrieval-Augmented Generation (RAG). Existing work typically employs few-shot prompting or manually constructed rules to implement iterative retrieval. This introduces additional inference overhe..."
      },
      {
        "title": "Improving the Domain Adaptation of Retrieval Augmented Generation (RAG) Models for Open Domain Question Answering",
        "authors": [
          "Shamane Siriwardhana",
          "Rivindu Weerasekera",
          "Elliott Wen",
          "Tharindu Kaluarachchi",
          "Rajib Rana",
          "Suranga Nanayakkara"
        ],
        "published": "2022-10-06",
        "link": "http://arxiv.org/abs/2210.02627v1",
        "summary": "Retrieval Augment Generation (RAG) is a recent advancement in Open-Domain Question Answering (ODQA). RAG has only been trained and explored with a Wikipedia-based external knowledge base and is not optimized for use in other specialized domains such as healthcare and news. In this paper, we evaluate the impact of joint training of the retriever and generator components of RAG for the task of domai..."
      }
    ],
    "Retrieval-Augmented Generation": [
      {
        "title": "AR-RAG: Autoregressive Retrieval Augmentation for Image Generation",
        "authors": [
          "Jingyuan Qi",
          "Zhiyang Xu",
          "Qifan Wang",
          "Lifu Huang"
        ],
        "published": "2025-06-08",
        "link": "http://arxiv.org/abs/2506.06962v3",
        "summary": "We introduce Autoregressive Retrieval Augmentation (AR-RAG), a novel paradigm that enhances image generation by autoregressively incorporating knearest neighbor retrievals at the patch level. Unlike prior methods that perform a single, static retrieval before generation and condition the entire generation on fixed reference images, AR-RAG performs context-aware retrievals at each generation step, ..."
      },
      {
        "title": "EVOR: Evolving Retrieval for Code Generation",
        "authors": [
          "Hongjin Su",
          "Shuyang Jiang",
          "Yuhang Lai",
          "Haoyuan Wu",
          "Boao Shi",
          "Che Liu",
          "Qian Liu",
          "Tao Yu"
        ],
        "published": "2024-02-19",
        "link": "http://arxiv.org/abs/2402.12317v2",
        "summary": "Recently the retrieval-augmented generation (RAG) has been successfully applied in code generation. However, existing pipelines for retrieval-augmented code generation (RACG) employ static knowledge bases with a single source, limiting the adaptation capabilities of Large Language Models (LLMs) to domains they have insufficient knowledge of. In this work, we develop a novel pipeline, EVOR, that em..."
      },
      {
        "title": "Automated Literature Review Using NLP Techniques and LLM-Based Retrieval-Augmented Generation",
        "authors": [
          "Nurshat Fateh Ali",
          "Md. Mahdi Mohtasim",
          "Shakil Mosharrof",
          "T. Gopi Krishna"
        ],
        "published": "2024-11-27",
        "link": "http://arxiv.org/abs/2411.18583v1",
        "summary": "This research presents and compares multiple approaches to automate the generation of literature reviews using several Natural Language Processing (NLP) techniques and retrieval-augmented generation (RAG) with a Large Language Model (LLM). The ever-increasing number of research articles provides a huge challenge for manual literature review. It has resulted in an increased demand for automation. D..."
      },
      {
        "title": "Riddle Me This! Stealthy Membership Inference for Retrieval-Augmented Generation",
        "authors": [
          "Ali Naseh",
          "Yuefeng Peng",
          "Anshuman Suri",
          "Harsh Chaudhari",
          "Alina Oprea",
          "Amir Houmansadr"
        ],
        "published": "2025-02-01",
        "link": "http://arxiv.org/abs/2502.00306v2",
        "summary": "Retrieval-Augmented Generation (RAG) enables Large Language Models (LLMs) to generate grounded responses by leveraging external knowledge databases without altering model parameters. Although the absence of weight tuning prevents leakage via model parameters, it introduces the risk of inference adversaries exploiting retrieved documents in the model's context. Existing methods for membership infer..."
      },
      {
        "title": "FAIR-RAG: Faithful Adaptive Iterative Refinement for Retrieval-Augmented Generation",
        "authors": [
          "Mohammad Aghajani Asl",
          "Majid Asgari-Bidhendi",
          "Behrooz Minaei-Bidgoli"
        ],
        "published": "2025-10-25",
        "link": "http://arxiv.org/abs/2510.22344v1",
        "summary": "While Retrieval-Augmented Generation (RAG) mitigates hallucination and knowledge staleness in Large Language Models (LLMs), existing frameworks often falter on complex, multi-hop queries that require synthesizing information from disparate sources. Current advanced RAG methods, employing iterative or adaptive strategies, lack a robust mechanism to systematically identify and fill evidence gaps, of..."
      },
      {
        "title": "Investigating Retrieval-Augmented Generation in Quranic Studies: A Study of 13 Open-Source Large Language Models",
        "authors": [
          "Zahra Khalila",
          "Arbi Haza Nasution",
          "Winda Monika",
          "Aytug Onan",
          "Yohei Murakami",
          "Yasir Bin Ismail Radi",
          "Noor Mohammad Osmani"
        ],
        "published": "2025-03-20",
        "link": "http://arxiv.org/abs/2503.16581v1",
        "summary": "Accurate and contextually faithful responses are critical when applying large language models (LLMs) to sensitive and domain-specific tasks, such as answering queries related to quranic studies. General-purpose LLMs often struggle with hallucinations, where generated responses deviate from authoritative sources, raising concerns about their reliability in religious contexts. This challenge highlig..."
      },
      {
        "title": "Ragas: Automated Evaluation of Retrieval Augmented Generation",
        "authors": [
          "Shahul Es",
          "Jithin James",
          "Luis Espinosa-Anke",
          "Steven Schockaert"
        ],
        "published": "2023-09-26",
        "link": "http://arxiv.org/abs/2309.15217v2",
        "summary": "We introduce Ragas (Retrieval Augmented Generation Assessment), a framework for reference-free evaluation of Retrieval Augmented Generation (RAG) pipelines. RAG systems are composed of a retrieval and an LLM based generation module, and provide LLMs with knowledge from a reference textual database, which enables them to act as a natural language layer between a user and textual databases, reducing..."
      },
      {
        "title": "A Collaborative Multi-Agent Approach to Retrieval-Augmented Generation Across Diverse Data",
        "authors": [
          "Aniruddha Salve",
          "Saba Attar",
          "Mahesh Deshmukh",
          "Sayali Shivpuje",
          "Arnab Mitra Utsab"
        ],
        "published": "2024-12-08",
        "link": "http://arxiv.org/abs/2412.05838v1",
        "summary": "Retrieval-Augmented Generation (RAG) enhances Large Language Models (LLMs) by incorporating external, domain-specific data into the generative process. While LLMs are highly capable, they often rely on static, pre-trained datasets, limiting their ability to integrate dynamic or private data. Traditional RAG systems typically use a single-agent architecture to handle query generation, data retrieva..."
      },
      {
        "title": "Reconstructing Context: Evaluating Advanced Chunking Strategies for Retrieval-Augmented Generation",
        "authors": [
          "Carlo Merola",
          "Jaspinder Singh"
        ],
        "published": "2025-04-28",
        "link": "http://arxiv.org/abs/2504.19754v1",
        "summary": "Retrieval-augmented generation (RAG) has become a transformative approach for enhancing large language models (LLMs) by grounding their outputs in external knowledge sources. Yet, a critical question persists: how can vast volumes of external knowledge be managed effectively within the input constraints of LLMs? Traditional methods address this by chunking external documents into smaller, fixed-si..."
      },
      {
        "title": "Blended RAG: Improving RAG (Retriever-Augmented Generation) Accuracy with Semantic Search and Hybrid Query-Based Retrievers",
        "authors": [
          "Kunal Sawarkar",
          "Abhilasha Mangal",
          "Shivam Raj Solanki"
        ],
        "published": "2024-03-22",
        "link": "http://arxiv.org/abs/2404.07220v2",
        "summary": "Retrieval-Augmented Generation (RAG) is a prevalent approach to infuse a private knowledge base of documents with Large Language Models (LLM) to build Generative Q\\&A (Question-Answering) systems. However, RAG accuracy becomes increasingly challenging as the corpus of documents scales up, with Retrievers playing an outsized role in the overall RAG accuracy by extracting the most relevant document ..."
      },
      {
        "title": "Multi-Task Retrieval-Augmented Text Generation with Relevance Sampling",
        "authors": [
          "Sebastian Hofstätter",
          "Jiecao Chen",
          "Karthik Raman",
          "Hamed Zamani"
        ],
        "published": "2022-07-07",
        "link": "http://arxiv.org/abs/2207.03030v1",
        "summary": "This paper studies multi-task training of retrieval-augmented generation models for knowledge-intensive tasks. We propose to clean the training set by utilizing a distinct property of knowledge-intensive generation: The connection of query-answer pairs to items in the knowledge base. We filter training examples via a threshold of confidence on the relevance labels, whether a pair is answerable by ..."
      },
      {
        "title": "Retrieval-Augmented Audio Deepfake Detection",
        "authors": [
          "Zuheng Kang",
          "Yayun He",
          "Botao Zhao",
          "Xiaoyang Qu",
          "Junqing Peng",
          "Jing Xiao",
          "Jianzong Wang"
        ],
        "published": "2024-04-22",
        "link": "http://arxiv.org/abs/2404.13892v2",
        "summary": "With recent advances in speech synthesis including text-to-speech (TTS) and voice conversion (VC) systems enabling the generation of ultra-realistic audio deepfakes, there is growing concern about their potential misuse. However, most deepfake (DF) detection methods rely solely on the fuzzy knowledge learned by a single model, resulting in performance bottlenecks and transparency issues. Inspired ..."
      },
      {
        "title": "Tree of Reviews: A Tree-based Dynamic Iterative Retrieval Framework for Multi-hop Question Answering",
        "authors": [
          "Li Jiapeng",
          "Liu Runze",
          "Li Yabo",
          "Zhou Tong",
          "Li Mingling",
          "Chen Xiang"
        ],
        "published": "2024-04-22",
        "link": "http://arxiv.org/abs/2404.14464v1",
        "summary": "Multi-hop question answering is a knowledge-intensive complex problem. Large Language Models (LLMs) use their Chain of Thoughts (CoT) capability to reason complex problems step by step, and retrieval-augmentation can effectively alleviate factual errors caused by outdated and unknown knowledge in LLMs. Recent works have introduced retrieval-augmentation in the CoT reasoning to solve multi-hop ques..."
      },
      {
        "title": "Retrieval-Augmented Generation in Industry: An Interview Study on Use Cases, Requirements, Challenges, and Evaluation",
        "authors": [
          "Lorenz Brehme",
          "Benedikt Dornauer",
          "Thomas Ströhle",
          "Maximilian Ehrhart",
          "Ruth Breu"
        ],
        "published": "2025-08-11",
        "link": "http://arxiv.org/abs/2508.14066v1",
        "summary": "Retrieval-Augmented Generation (RAG) is a well-established and rapidly evolving field within AI that enhances the outputs of large language models by integrating relevant information retrieved from external knowledge sources. While industry adoption of RAG is now beginning, there is a significant lack of research on its practical application in industrial contexts. To address this gap, we conducte..."
      },
      {
        "title": "Intelligent Interaction Strategies for Context-Aware Cognitive Augmentation",
        "authors": [
          "Xiangrong",
          "Zhu",
          "Yuan Xu",
          "Tianjian Liu",
          "Jingwei Sun",
          "Yu Zhang",
          "Xin Tong"
        ],
        "published": "2025-04-18",
        "link": "http://arxiv.org/abs/2504.13684v1",
        "summary": "Human cognition is constrained by processing limitations, leading to cognitive overload and inefficiencies in knowledge synthesis and decision-making. Large Language Models (LLMs) present an opportunity for cognitive augmentation, but their current reactive nature limits their real-world applicability. This position paper explores the potential of context-aware cognitive augmentation, where LLMs d..."
      }
    ],
    "Computer Vision": [
      {
        "title": "WiCV 2019: The Sixth Women In Computer Vision Workshop",
        "authors": [
          "Irene Amerini",
          "Elena Balashova",
          "Sayna Ebrahimi",
          "Kathryn Leonard",
          "Arsha Nagrani",
          "Amaia Salvador"
        ],
        "published": "2019-09-23",
        "link": "http://arxiv.org/abs/1909.10225v1",
        "summary": "In this paper we present the Women in Computer Vision Workshop - WiCV 2019, organized in conjunction with CVPR 2019. This event is meant for increasing the visibility and inclusion of women researchers in the computer vision field. Computer vision and machine learning have made incredible progress over the past years, but the number of female researchers is still low both in academia and in indust..."
      },
      {
        "title": "Spatial Monitoring and Insect Behavioural Analysis Using Computer Vision for Precision Pollination",
        "authors": [
          "Malika Nisal Ratnayake",
          "Don Chathurika Amarathunga",
          "Asaduz Zaman",
          "Adrian G. Dyer",
          "Alan Dorin"
        ],
        "published": "2022-05-10",
        "link": "http://arxiv.org/abs/2205.04675v2",
        "summary": "Insects are the most important global pollinator of crops and play a key role in maintaining the sustainability of natural ecosystems. Insect pollination monitoring and management are therefore essential for improving crop production and food security. Computer vision facilitated pollinator monitoring can intensify data collection over what is feasible using manual approaches. The new data it gene..."
      },
      {
        "title": "Global Adaptive Filtering Layer for Computer Vision",
        "authors": [
          "Viktor Shipitsin",
          "Iaroslav Bespalov",
          "Dmitry V. Dylov"
        ],
        "published": "2020-10-02",
        "link": "http://arxiv.org/abs/2010.01177v4",
        "summary": "We devise a universal adaptive neural layer to \"learn\" optimal frequency filter for each image together with the weights of the base neural network that performs some computer vision task. The proposed approach takes the source image in the spatial domain, automatically selects the best frequencies from the frequency domain, and transmits the inverse-transform image to the main neural network. Rem..."
      },
      {
        "title": "What Does TERRA-REF's High Resolution, Multi Sensor Plant Sensing Public Domain Data Offer the Computer Vision Community?",
        "authors": [
          "David LeBauer",
          "Max Burnette",
          "Noah Fahlgren",
          "Rob Kooper",
          "Kenton McHenry",
          "Abby Stylianou"
        ],
        "published": "2021-07-29",
        "link": "http://arxiv.org/abs/2107.14072v2",
        "summary": "A core objective of the TERRA-REF project was to generate an open-access reference dataset for the evaluation of sensing technologies to study plants under field conditions. The TERRA-REF program deployed a suite of high-resolution, cutting edge technology sensors on a gantry system with the aim of scanning 1 hectare (10$^4$) at around 1 mm$^2$ spatial resolution multiple times per week. The syste..."
      },
      {
        "title": "The Informed Sampler: A Discriminative Approach to Bayesian Inference in Generative Computer Vision Models",
        "authors": [
          "Varun Jampani",
          "Sebastian Nowozin",
          "Matthew Loper",
          "Peter V. Gehler"
        ],
        "published": "2014-02-04",
        "link": "http://arxiv.org/abs/1402.0859v3",
        "summary": "Computer vision is hard because of a large variability in lighting, shape, and texture; in addition the image signal is non-additive due to occlusion. Generative models promised to account for this variability by accurately modelling the image formation process as a function of latent variables with prior beliefs. Bayesian posterior inference could then, in principle, explain the observation. Whil..."
      },
      {
        "title": "Novel Convolution Kernels for Computer Vision and Shape Analysis based on Electromagnetism",
        "authors": [
          "Dominique Beaini",
          "Sofiane Achiche",
          "Yann-Seing Law-Kam Cio",
          "Maxime Raison"
        ],
        "published": "2018-06-20",
        "link": "http://arxiv.org/abs/1806.07996v1",
        "summary": "Computer vision is a growing field with a lot of new applications in automation and robotics, since it allows the analysis of images and shapes for the generation of numerical or analytical information. One of the most used method of information extraction is image filtering through convolution kernels, with each kernel specialized for specific applications. The objective of this paper is to prese..."
      },
      {
        "title": "Vision Based Game Development Using Human Computer Interaction",
        "authors": [
          "S. Sumathi",
          "S. K. Srivatsa",
          "M. Uma Maheswari"
        ],
        "published": "2010-02-10",
        "link": "http://arxiv.org/abs/1002.2191v1",
        "summary": "A Human Computer Interface (HCI) System for playing games is designed here for more natural communication with the machines. The system presented here is a vision-based system for detection of long voluntary eye blinks and interpretation of blink patterns for communication between man and machine. This system replaces the mouse with the human face as a new way to interact with the computer. Facial..."
      },
      {
        "title": "Crowdsourcing in Computer Vision",
        "authors": [
          "Adriana Kovashka",
          "Olga Russakovsky",
          "Li Fei-Fei",
          "Kristen Grauman"
        ],
        "published": "2016-11-07",
        "link": "http://arxiv.org/abs/1611.02145v1",
        "summary": "Computer vision systems require large amounts of manually annotated data to properly learn challenging visual concepts. Crowdsourcing platforms offer an inexpensive method to capture human knowledge and understanding, for a vast number of visual perception tasks. In this survey, we describe the types of annotations computer vision researchers have collected using crowdsourcing, and how they have e..."
      },
      {
        "title": "FedCV: A Federated Learning Framework for Diverse Computer Vision Tasks",
        "authors": [
          "Chaoyang He",
          "Alay Dilipbhai Shah",
          "Zhenheng Tang",
          "Di Fan1Adarshan Naiynar Sivashunmugam",
          "Keerti Bhogaraju",
          "Mita Shimpi",
          "Li Shen",
          "Xiaowen Chu",
          "Mahdi Soltanolkotabi",
          "Salman Avestimehr"
        ],
        "published": "2021-11-22",
        "link": "http://arxiv.org/abs/2111.11066v1",
        "summary": "Federated Learning (FL) is a distributed learning paradigm that can learn a global or personalized model from decentralized datasets on edge devices. However, in the computer vision domain, model performance in FL is far behind centralized training due to the lack of exploration in diverse tasks with a unified FL framework. FL has rarely been demonstrated effectively in advanced computer vision ta..."
      },
      {
        "title": "Second Croatian Computer Vision Workshop (CCVW 2013)",
        "authors": [
          "Sven Lončarić",
          "Siniša Šegvić"
        ],
        "published": "2013-10-01",
        "link": "http://arxiv.org/abs/1310.0319v3",
        "summary": "Proceedings of the Second Croatian Computer Vision Workshop (CCVW 2013, http://www.fer.unizg.hr/crv/ccvw2013) held September 19, 2013, in Zagreb, Croatia. Workshop was organized by the Center of Excellence for Computer Vision of the University of Zagreb...."
      },
      {
        "title": "The Evolution of First Person Vision Methods: A Survey",
        "authors": [
          "Alejandro Betancourt",
          "Pietro Morerio",
          "Carlo S. Regazzoni",
          "Matthias Rauterberg"
        ],
        "published": "2014-09-04",
        "link": "http://arxiv.org/abs/1409.1484v3",
        "summary": "The emergence of new wearable technologies such as action cameras and smart-glasses has increased the interest of computer vision scientists in the First Person perspective. Nowadays, this field is attracting attention and investments of companies aiming to develop commercial devices with First Person Vision recording capabilities. Due to this interest, an increasing demand of methods to process t..."
      },
      {
        "title": "A Comparative Study of Graph Matching Algorithms in Computer Vision",
        "authors": [
          "Stefan Haller",
          "Lorenz Feineis",
          "Lisa Hutschenreiter",
          "Florian Bernard",
          "Carsten Rother",
          "Dagmar Kainmüller",
          "Paul Swoboda",
          "Bogdan Savchynskyy"
        ],
        "published": "2022-07-01",
        "link": "http://arxiv.org/abs/2207.00291v2",
        "summary": "The graph matching optimization problem is an essential component for many tasks in computer vision, such as bringing two deformable objects in correspondence. Naturally, a wide range of applicable algorithms have been proposed in the last decades. Since a common standard benchmark has not been developed, their performance claims are often hard to verify as evaluation on differing problem instance..."
      },
      {
        "title": "Deep Learning vs. Traditional Computer Vision",
        "authors": [
          "Niall O' Mahony",
          "Sean Campbell",
          "Anderson Carvalho",
          "Suman Harapanahalli",
          "Gustavo Velasco-Hernandez",
          "Lenka Krpalkova",
          "Daniel Riordan",
          "Joseph Walsh"
        ],
        "published": "2019-10-30",
        "link": "http://arxiv.org/abs/1910.13796v1",
        "summary": "Deep Learning has pushed the limits of what was possible in the domain of Digital Image Processing. However, that is not to say that the traditional computer vision techniques which had been undergoing progressive development in years prior to the rise of DL have become obsolete. This paper will analyse the benefits and drawbacks of each approach. The aim of this paper is to promote a discussion o..."
      },
      {
        "title": "Food for thought: Ethical considerations of user trust in computer vision",
        "authors": [
          "Kaylen J. Pfisterer",
          "Jennifer Boger",
          "Alexander Wong"
        ],
        "published": "2019-05-29",
        "link": "http://arxiv.org/abs/1905.12487v1",
        "summary": "In computer vision research, especially when novel applications of tools are developed, ethical implications around user perceptions of trust in the underlying technology should be considered and supported. Here, we describe an example of the incorporation of such considerations within the long-term care sector for tracking resident food and fluid intake. We highlight our recent user study conduct..."
      },
      {
        "title": "Computer Vision Systems in Road Vehicles: A Review",
        "authors": [
          "Kristian Kovačić",
          "Edouard Ivanjko",
          "Hrvoje Gold"
        ],
        "published": "2013-10-01",
        "link": "http://arxiv.org/abs/1310.0315v1",
        "summary": "The number of road vehicles significantly increased in recent decades. This trend accompanied a build-up of road infrastructure and development of various control systems to increase road traffic safety, road capacity and travel comfort. In traffic safety significant development has been made and today's systems more and more include cameras and computer vision methods. Cameras are used as part of..."
      }
    ]
  }
}